MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx570f512h.h
extern volatile __ANSELDbits_t ANSELDbits __asm__ ("ANSELD") __attribute__((section("sfrs"), address(0xBF886300)));
extern volatile uint32_t        ANSELDCLR __attribute__((section("sfrs"),address(0xBF886304)));
extern volatile uint32_t        ANSELDSET __attribute__((section("sfrs"),address(0xBF886308)));
extern volatile uint32_t        ANSELDINV __attribute__((section("sfrs"),address(0xBF88630C)));
#define TRISD TRISD
extern volatile uint32_t   TRISD __attribute__((section("sfrs"), address(0xBF886310)));
typedef union {
  struct {
    uint32_t TRISD0:1;
    uint32_t TRISD1:1;
    uint32_t TRISD2:1;
    uint32_t TRISD3:1;
    uint32_t TRISD4:1;
    uint32_t TRISD5:1;
    uint32_t TRISD6:1;
    uint32_t TRISD7:1;
    uint32_t TRISD8:1;
    uint32_t TRISD9:1;
    uint32_t TRISD10:1;
    uint32_t TRISD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISDbits_t;
extern volatile __TRISDbits_t TRISDbits __asm__ ("TRISD") __attribute__((section("sfrs"), address(0xBF886310)));
extern volatile uint32_t        TRISDCLR __attribute__((section("sfrs"),address(0xBF886314)));
extern volatile uint32_t        TRISDSET __attribute__((section("sfrs"),address(0xBF886318)));
extern volatile uint32_t        TRISDINV __attribute__((section("sfrs"),address(0xBF88631C)));
#define PORTD PORTD
extern volatile uint32_t   PORTD __attribute__((section("sfrs"), address(0xBF886320)));
typedef union {
  struct {
    uint32_t RD0:1;
    uint32_t RD1:1;
    uint32_t RD2:1;
    uint32_t RD3:1;
    uint32_t RD4:1;
    uint32_t RD5:1;
    uint32_t RD6:1;
    uint32_t RD7:1;
    uint32_t RD8:1;
    uint32_t RD9:1;
    uint32_t RD10:1;
    uint32_t RD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTDbits_t;
extern volatile __PORTDbits_t PORTDbits __asm__ ("PORTD") __attribute__((section("sfrs"), address(0xBF886320)));
extern volatile uint32_t        PORTDCLR __attribute__((section("sfrs"),address(0xBF886324)));
extern volatile uint32_t        PORTDSET __attribute__((section("sfrs"),address(0xBF886328)));
extern volatile uint32_t        PORTDINV __attribute__((section("sfrs"),address(0xBF88632C)));
#define LATD LATD
extern volatile uint32_t   LATD __attribute__((section("sfrs"), address(0xBF886330)));
typedef union {
  struct {
    uint32_t LATD0:1;
    uint32_t LATD1:1;
    uint32_t LATD2:1;
    uint32_t LATD3:1;
    uint32_t LATD4:1;
    uint32_t LATD5:1;
    uint32_t LATD6:1;
    uint32_t LATD7:1;
    uint32_t LATD8:1;
    uint32_t LATD9:1;
    uint32_t LATD10:1;
    uint32_t LATD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATDbits_t;
extern volatile __LATDbits_t LATDbits __asm__ ("LATD") __attribute__((section("sfrs"), address(0xBF886330)));
extern volatile uint32_t        LATDCLR __attribute__((section("sfrs"),address(0xBF886334)));
extern volatile uint32_t        LATDSET __attribute__((section("sfrs"),address(0xBF886338)));
extern volatile uint32_t        LATDINV __attribute__((section("sfrs"),address(0xBF88633C)));
#define ODCD ODCD
extern volatile uint32_t   ODCD __attribute__((section("sfrs"), address(0xBF886340)));
typedef union {
  struct {
    uint32_t ODCD0:1;
    uint32_t ODCD1:1;
    uint32_t ODCD2:1;
    uint32_t ODCD3:1;
    uint32_t ODCD4:1;
    uint32_t ODCD5:1;
    uint32_t ODCD6:1;
    uint32_t ODCD7:1;
    uint32_t ODCD8:1;
    uint32_t ODCD9:1;
    uint32_t ODCD10:1;
    uint32_t ODCD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCDbits_t;
extern volatile __ODCDbits_t ODCDbits __asm__ ("ODCD") __attribute__((section("sfrs"), address(0xBF886340)));
extern volatile uint32_t        ODCDCLR __attribute__((section("sfrs"),address(0xBF886344)));
extern volatile uint32_t        ODCDSET __attribute__((section("sfrs"),address(0xBF886348)));
extern volatile uint32_t        ODCDINV __attribute__((section("sfrs"),address(0xBF88634C)));
#define CNPUD CNPUD
extern volatile uint32_t   CNPUD __attribute__((section("sfrs"), address(0xBF886350)));
typedef union {
  struct {
    uint32_t CNPUD0:1;
    uint32_t CNPUD1:1;
    uint32_t CNPUD2:1;
    uint32_t CNPUD3:1;
    uint32_t CNPUD4:1;
    uint32_t CNPUD5:1;
    uint32_t CNPUD6:1;
    uint32_t CNPUD7:1;
    uint32_t CNPUD8:1;
    uint32_t CNPUD9:1;
    uint32_t CNPUD10:1;
    uint32_t CNPUD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUDbits_t;
extern volatile __CNPUDbits_t CNPUDbits __asm__ ("CNPUD") __attribute__((section("sfrs"), address(0xBF886350)));
extern volatile uint32_t        CNPUDCLR __attribute__((section("sfrs"),address(0xBF886354)));
extern volatile uint32_t        CNPUDSET __attribute__((section("sfrs"),address(0xBF886358)));
extern volatile uint32_t        CNPUDINV __attribute__((section("sfrs"),address(0xBF88635C)));
#define CNPDD CNPDD
extern volatile uint32_t   CNPDD __attribute__((section("sfrs"), address(0xBF886360)));
typedef union {
  struct {
    uint32_t CNPDD0:1;
    uint32_t CNPDD1:1;
    uint32_t CNPDD2:1;
    uint32_t CNPDD3:1;
    uint32_t CNPDD4:1;
    uint32_t CNPDD5:1;
    uint32_t CNPDD6:1;
    uint32_t CNPDD7:1;
    uint32_t CNPDD8:1;
    uint32_t CNPDD9:1;
    uint32_t CNPDD10:1;
    uint32_t CNPDD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDDbits_t;
extern volatile __CNPDDbits_t CNPDDbits __asm__ ("CNPDD") __attribute__((section("sfrs"), address(0xBF886360)));
extern volatile uint32_t        CNPDDCLR __attribute__((section("sfrs"),address(0xBF886364)));
extern volatile uint32_t        CNPDDSET __attribute__((section("sfrs"),address(0xBF886368)));
extern volatile uint32_t        CNPDDINV __attribute__((section("sfrs"),address(0xBF88636C)));
#define CNCOND CNCOND
extern volatile uint32_t   CNCOND __attribute__((section("sfrs"), address(0xBF886370)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONDbits_t;
extern volatile __CNCONDbits_t CNCONDbits __asm__ ("CNCOND") __attribute__((section("sfrs"), address(0xBF886370)));
extern volatile uint32_t        CNCONDCLR __attribute__((section("sfrs"),address(0xBF886374)));
extern volatile uint32_t        CNCONDSET __attribute__((section("sfrs"),address(0xBF886378)));
extern volatile uint32_t        CNCONDINV __attribute__((section("sfrs"),address(0xBF88637C)));
#define CNEND CNEND
extern volatile uint32_t   CNEND __attribute__((section("sfrs"), address(0xBF886380)));
typedef union {
  struct {
    uint32_t CNIED0:1;
    uint32_t CNIED1:1;
    uint32_t CNIED2:1;
    uint32_t CNIED3:1;
    uint32_t CNIED4:1;
    uint32_t CNIED5:1;
    uint32_t CNIED6:1;
    uint32_t CNIED7:1;
    uint32_t CNIED8:1;
    uint32_t CNIED9:1;
    uint32_t CNIED10:1;
    uint32_t CNIED11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENDbits_t;
extern volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs"), address(0xBF886380)));
extern volatile uint32_t        CNENDCLR __attribute__((section("sfrs"),address(0xBF886384)));
extern volatile uint32_t        CNENDSET __attribute__((section("sfrs"),address(0xBF886388)));
extern volatile uint32_t        CNENDINV __attribute__((section("sfrs"),address(0xBF88638C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF886390)));
typedef union {
  struct {
    uint32_t CNSTATD0:1;
    uint32_t CNSTATD1:1;
    uint32_t CNSTATD2:1;
    uint32_t CNSTATD3:1;
    uint32_t CNSTATD4:1;
    uint32_t CNSTATD5:1;
    uint32_t CNSTATD6:1;
    uint32_t CNSTATD7:1;
    uint32_t CNSTATD8:1;
    uint32_t CNSTATD9:1;
    uint32_t CNSTATD10:1;
    uint32_t CNSTATD11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF886390)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF886394)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF886398)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF88639C)));
#define ANSELE ANSELE
extern volatile uint32_t   ANSELE __attribute__((section("sfrs"), address(0xBF886400)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t ANSE2:1;
    uint32_t :1;
    uint32_t ANSE4:1;
    uint32_t ANSE5:1;
    uint32_t ANSE6:1;
    uint32_t ANSE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELEbits_t;
extern volatile __ANSELEbits_t ANSELEbits __asm__ ("ANSELE") __attribute__((section("sfrs"), address(0xBF886400)));
extern volatile uint32_t        ANSELECLR __attribute__((section("sfrs"),address(0xBF886404)));
extern volatile uint32_t        ANSELESET __attribute__((section("sfrs"),address(0xBF886408)));
extern volatile uint32_t        ANSELEINV __attribute__((section("sfrs"),address(0xBF88640C)));
#define TRISE TRISE
extern volatile uint32_t   TRISE __attribute__((section("sfrs"), address(0xBF886410)));
typedef union {
  struct {
    uint32_t TRISE0:1;
    uint32_t TRISE1:1;
    uint32_t TRISE2:1;
    uint32_t TRISE3:1;
    uint32_t TRISE4:1;
    uint32_t TRISE5:1;
    uint32_t TRISE6:1;
    uint32_t TRISE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISEbits_t;
extern volatile __TRISEbits_t TRISEbits __asm__ ("TRISE") __attribute__((section("sfrs"), address(0xBF886410)));
extern volatile uint32_t        TRISECLR __attribute__((section("sfrs"),address(0xBF886414)));
extern volatile uint32_t        TRISESET __attribute__((section("sfrs"),address(0xBF886418)));
extern volatile uint32_t        TRISEINV __attribute__((section("sfrs"),address(0xBF88641C)));
#define PORTE PORTE
extern volatile uint32_t   PORTE __attribute__((section("sfrs"), address(0xBF886420)));
typedef union {
  struct {
    uint32_t RE0:1;
    uint32_t RE1:1;
    uint32_t RE2:1;
    uint32_t RE3:1;
    uint32_t RE4:1;
    uint32_t RE5:1;
    uint32_t RE6:1;
    uint32_t RE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTEbits_t;
extern volatile __PORTEbits_t PORTEbits __asm__ ("PORTE") __attribute__((section("sfrs"), address(0xBF886420)));
extern volatile uint32_t        PORTECLR __attribute__((section("sfrs"),address(0xBF886424)));
extern volatile uint32_t        PORTESET __attribute__((section("sfrs"),address(0xBF886428)));
extern volatile uint32_t        PORTEINV __attribute__((section("sfrs"),address(0xBF88642C)));
#define LATE LATE
extern volatile uint32_t   LATE __attribute__((section("sfrs"), address(0xBF886430)));
typedef union {
  struct {
    uint32_t LATE0:1;
    uint32_t LATE1:1;
    uint32_t LATE2:1;
    uint32_t LATE3:1;
    uint32_t LATE4:1;
    uint32_t LATE5:1;
    uint32_t LATE6:1;
    uint32_t LATE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATEbits_t;
extern volatile __LATEbits_t LATEbits __asm__ ("LATE") __attribute__((section("sfrs"), address(0xBF886430)));
extern volatile uint32_t        LATECLR __attribute__((section("sfrs"),address(0xBF886434)));
extern volatile uint32_t        LATESET __attribute__((section("sfrs"),address(0xBF886438)));
extern volatile uint32_t        LATEINV __attribute__((section("sfrs"),address(0xBF88643C)));
#define ODCE ODCE
extern volatile uint32_t   ODCE __attribute__((section("sfrs"), address(0xBF886440)));
typedef union {
  struct {
    uint32_t ODCE0:1;
    uint32_t ODCE1:1;
    uint32_t ODCE2:1;
    uint32_t ODCE3:1;
    uint32_t ODCE4:1;
    uint32_t ODCE5:1;
    uint32_t ODCE6:1;
    uint32_t ODCE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCEbits_t;
extern volatile __ODCEbits_t ODCEbits __asm__ ("ODCE") __attribute__((section("sfrs"), address(0xBF886440)));
extern volatile uint32_t        ODCECLR __attribute__((section("sfrs"),address(0xBF886444)));
extern volatile uint32_t        ODCESET __attribute__((section("sfrs"),address(0xBF886448)));
extern volatile uint32_t        ODCEINV __attribute__((section("sfrs"),address(0xBF88644C)));
#define CNPUE CNPUE
extern volatile uint32_t   CNPUE __attribute__((section("sfrs"), address(0xBF886450)));
typedef union {
  struct {
    uint32_t CNPUE0:1;
    uint32_t CNPUE1:1;
    uint32_t CNPUE2:1;
    uint32_t CNPUE3:1;
    uint32_t CNPUE4:1;
    uint32_t CNPUE5:1;
    uint32_t CNPUE6:1;
    uint32_t CNPUE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUEbits_t;
extern volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE") __attribute__((section("sfrs"), address(0xBF886450)));
extern volatile uint32_t        CNPUECLR __attribute__((section("sfrs"),address(0xBF886454)));
extern volatile uint32_t        CNPUESET __attribute__((section("sfrs"),address(0xBF886458)));
extern volatile uint32_t        CNPUEINV __attribute__((section("sfrs"),address(0xBF88645C)));
#define CNPDE CNPDE
extern volatile uint32_t   CNPDE __attribute__((section("sfrs"), address(0xBF886460)));
typedef union {
  struct {
    uint32_t CNPDE0:1;
    uint32_t CNPDE1:1;
    uint32_t CNPDE2:1;
    uint32_t CNPDE3:1;
    uint32_t CNPDE4:1;
    uint32_t CNPDE5:1;
    uint32_t CNPDE6:1;
    uint32_t CNPDE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDEbits_t;
extern volatile __CNPDEbits_t CNPDEbits __asm__ ("CNPDE") __attribute__((section("sfrs"), address(0xBF886460)));
extern volatile uint32_t        CNPDECLR __attribute__((section("sfrs"),address(0xBF886464)));
extern volatile uint32_t        CNPDESET __attribute__((section("sfrs"),address(0xBF886468)));
extern volatile uint32_t        CNPDEINV __attribute__((section("sfrs"),address(0xBF88646C)));
#define CNCONE CNCONE
extern volatile uint32_t   CNCONE __attribute__((section("sfrs"), address(0xBF886470)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONEbits_t;
extern volatile __CNCONEbits_t CNCONEbits __asm__ ("CNCONE") __attribute__((section("sfrs"), address(0xBF886470)));
extern volatile uint32_t        CNCONECLR __attribute__((section("sfrs"),address(0xBF886474)));
extern volatile uint32_t        CNCONESET __attribute__((section("sfrs"),address(0xBF886478)));
extern volatile uint32_t        CNCONEINV __attribute__((section("sfrs"),address(0xBF88647C)));
#define CNENE CNENE
extern volatile uint32_t   CNENE __attribute__((section("sfrs"), address(0xBF886480)));
typedef union {
  struct {
    uint32_t CNIEE0:1;
    uint32_t CNIEE1:1;
    uint32_t CNIEE2:1;
    uint32_t CNIEE3:1;
    uint32_t CNIEE4:1;
    uint32_t CNIEE5:1;
    uint32_t CNIEE6:1;
    uint32_t CNIEE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENEbits_t;
extern volatile __CNENEbits_t CNENEbits __asm__ ("CNENE") __attribute__((section("sfrs"), address(0xBF886480)));
extern volatile uint32_t        CNENECLR __attribute__((section("sfrs"),address(0xBF886484)));
extern volatile uint32_t        CNENESET __attribute__((section("sfrs"),address(0xBF886488)));
extern volatile uint32_t        CNENEINV __attribute__((section("sfrs"),address(0xBF88648C)));
#define CNSTATE CNSTATE
extern volatile uint32_t   CNSTATE __attribute__((section("sfrs"), address(0xBF886490)));
typedef union {
  struct {
    uint32_t CNSTATE0:1;
    uint32_t CNSTATE1:1;
    uint32_t CNSTATE2:1;
    uint32_t CNSTATE3:1;
    uint32_t CNSTATE4:1;
    uint32_t CNSTATE5:1;
    uint32_t CNSTATE6:1;
    uint32_t CNSTATE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATEbits_t;
extern volatile __CNSTATEbits_t CNSTATEbits __asm__ ("CNSTATE") __attribute__((section("sfrs"), address(0xBF886490)));
extern volatile uint32_t        CNSTATECLR __attribute__((section("sfrs"),address(0xBF886494)));
extern volatile uint32_t        CNSTATESET __attribute__((section("sfrs"),address(0xBF886498)));
extern volatile uint32_t        CNSTATEINV __attribute__((section("sfrs"),address(0xBF88649C)));
#define ANSELF ANSELF
extern volatile uint32_t   ANSELF __attribute__((section("sfrs"), address(0xBF886500)));
typedef struct {
  uint32_t w:32;
} __ANSELFbits_t;
