MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx570f512h.h
#define _U7AMODE_ON_POSITION                     0x0000000F
#define _U7AMODE_ON_MASK                         0x00008000
#define _U7AMODE_ON_LENGTH                       0x00000001

#define _U7AMODE_PDSEL0_POSITION                 0x00000001
#define _U7AMODE_PDSEL0_MASK                     0x00000002
#define _U7AMODE_PDSEL0_LENGTH                   0x00000001

#define _U7AMODE_PDSEL1_POSITION                 0x00000002
#define _U7AMODE_PDSEL1_MASK                     0x00000004
#define _U7AMODE_PDSEL1_LENGTH                   0x00000001

#define _U7AMODE_UEN0_POSITION                   0x00000008
#define _U7AMODE_UEN0_MASK                       0x00000100
#define _U7AMODE_UEN0_LENGTH                     0x00000001

#define _U7AMODE_UEN1_POSITION                   0x00000009
#define _U7AMODE_UEN1_MASK                       0x00000200
#define _U7AMODE_UEN1_LENGTH                     0x00000001

#define _U7AMODE_USIDL_POSITION                  0x0000000D
#define _U7AMODE_USIDL_MASK                      0x00002000
#define _U7AMODE_USIDL_LENGTH                    0x00000001

#define _U7AMODE_UARTEN_POSITION                 0x0000000F
#define _U7AMODE_UARTEN_MASK                     0x00008000
#define _U7AMODE_UARTEN_LENGTH                   0x00000001

#define _U7AMODE_w_POSITION                      0x00000000
#define _U7AMODE_w_MASK                          0xFFFFFFFF
#define _U7AMODE_w_LENGTH                        0x00000020

#define _U4STA_URXDA_POSITION                    0x00000000
#define _U4STA_URXDA_MASK                        0x00000001
#define _U4STA_URXDA_LENGTH                      0x00000001

#define _U4STA_OERR_POSITION                     0x00000001
#define _U4STA_OERR_MASK                         0x00000002
#define _U4STA_OERR_LENGTH                       0x00000001

#define _U4STA_FERR_POSITION                     0x00000002
#define _U4STA_FERR_MASK                         0x00000004
#define _U4STA_FERR_LENGTH                       0x00000001

#define _U4STA_PERR_POSITION                     0x00000003
#define _U4STA_PERR_MASK                         0x00000008
#define _U4STA_PERR_LENGTH                       0x00000001

#define _U4STA_RIDLE_POSITION                    0x00000004
#define _U4STA_RIDLE_MASK                        0x00000010
#define _U4STA_RIDLE_LENGTH                      0x00000001

#define _U4STA_ADDEN_POSITION                    0x00000005
#define _U4STA_ADDEN_MASK                        0x00000020
#define _U4STA_ADDEN_LENGTH                      0x00000001

#define _U4STA_URXISEL_POSITION                  0x00000006
#define _U4STA_URXISEL_MASK                      0x000000C0
#define _U4STA_URXISEL_LENGTH                    0x00000002

#define _U4STA_TRMT_POSITION                     0x00000008
#define _U4STA_TRMT_MASK                         0x00000100
#define _U4STA_TRMT_LENGTH                       0x00000001

#define _U4STA_UTXBF_POSITION                    0x00000009
#define _U4STA_UTXBF_MASK                        0x00000200
#define _U4STA_UTXBF_LENGTH                      0x00000001

#define _U4STA_UTXEN_POSITION                    0x0000000A
#define _U4STA_UTXEN_MASK                        0x00000400
#define _U4STA_UTXEN_LENGTH                      0x00000001

#define _U4STA_UTXBRK_POSITION                   0x0000000B
#define _U4STA_UTXBRK_MASK                       0x00000800
#define _U4STA_UTXBRK_LENGTH                     0x00000001

#define _U4STA_URXEN_POSITION                    0x0000000C
#define _U4STA_URXEN_MASK                        0x00001000
#define _U4STA_URXEN_LENGTH                      0x00000001

#define _U4STA_UTXINV_POSITION                   0x0000000D
#define _U4STA_UTXINV_MASK                       0x00002000
#define _U4STA_UTXINV_LENGTH                     0x00000001

#define _U4STA_UTXISEL_POSITION                  0x0000000E
#define _U4STA_UTXISEL_MASK                      0x0000C000
#define _U4STA_UTXISEL_LENGTH                    0x00000002

#define _U4STA_ADDR_POSITION                     0x00000010
#define _U4STA_ADDR_MASK                         0x00FF0000
#define _U4STA_ADDR_LENGTH                       0x00000008

#define _U4STA_ADM_EN_POSITION                   0x00000018
#define _U4STA_ADM_EN_MASK                       0x01000000
#define _U4STA_ADM_EN_LENGTH                     0x00000001

#define _U4STA_URXISEL0_POSITION                 0x00000006
#define _U4STA_URXISEL0_MASK                     0x00000040
#define _U4STA_URXISEL0_LENGTH                   0x00000001

#define _U4STA_URXISEL1_POSITION                 0x00000007
#define _U4STA_URXISEL1_MASK                     0x00000080
#define _U4STA_URXISEL1_LENGTH                   0x00000001

#define _U4STA_UTXISEL0_POSITION                 0x0000000E
#define _U4STA_UTXISEL0_MASK                     0x00004000
#define _U4STA_UTXISEL0_LENGTH                   0x00000001

#define _U4STA_UTXISEL1_POSITION                 0x0000000F
#define _U4STA_UTXISEL1_MASK                     0x00008000
#define _U4STA_UTXISEL1_LENGTH                   0x00000001

#define _U4STA_UTXSEL_POSITION                   0x0000000E
#define _U4STA_UTXSEL_MASK                       0x0000C000
#define _U4STA_UTXSEL_LENGTH                     0x00000002

#define _U4STA_w_POSITION                        0x00000000
#define _U4STA_w_MASK                            0xFFFFFFFF
#define _U4STA_w_LENGTH                          0x00000020

#define _U7ASTA_URXDA_POSITION                   0x00000000
#define _U7ASTA_URXDA_MASK                       0x00000001
#define _U7ASTA_URXDA_LENGTH                     0x00000001

#define _U7ASTA_OERR_POSITION                    0x00000001
#define _U7ASTA_OERR_MASK                        0x00000002
#define _U7ASTA_OERR_LENGTH                      0x00000001

#define _U7ASTA_FERR_POSITION                    0x00000002
#define _U7ASTA_FERR_MASK                        0x00000004
#define _U7ASTA_FERR_LENGTH                      0x00000001

#define _U7ASTA_PERR_POSITION                    0x00000003
#define _U7ASTA_PERR_MASK                        0x00000008
#define _U7ASTA_PERR_LENGTH                      0x00000001

#define _U7ASTA_RIDLE_POSITION                   0x00000004
#define _U7ASTA_RIDLE_MASK                       0x00000010
#define _U7ASTA_RIDLE_LENGTH                     0x00000001

